var data=[ ];

var dataStar='1.火星救援<br>\
<br>\
导演: 雷德利·斯科特<br>\
编剧: 德鲁·高达 / 安迪·威尔<br>\
主演: 马特·达蒙 / 杰西卡·查斯坦 / 克里斯汀·韦格 / 杰夫·丹尼尔斯 / 迈克尔·佩纳 / 更多...<br>\
类型: 剧情 / 科幻 / 冒险<br>\<br>\
官方网站: www.foxmovies.com/movies/the-martian<br>\
制片国家/地区: 美国 / 英国<br>\
语言: 英语 / 汉语普通话<br>\
上映日期: 2015-11-25(中国大陆) / 2015-10-02(美国)<br>\
片长: 144分钟<br>\
<br>\
<br>\
2.我的特工爷爷<br>\
<br>\
导演: 洪金宝<br>\
编剧: 江均<br>\
主演: 洪金宝 / 刘德华 / 朱雨辰 / 李勤勤 / 冯嘉怡 / 更多...<br>\
类型: 剧情 / 动作 / 冒险<br>\
制片国家/地区: 香港 / 中国大陆<br>\
语言: 汉语普通话 / 粤语<br>\
上映日期: 2016-04-01(中国大陆)<br>\
片长: 99分钟<br>\
又名: 老卫兵 / My Beloved Bodyguard<br>\
<br>\
<br>\
3.火锅英雄<br>\
<br>\
导演: 杨庆<br>\
编剧: 杨庆<br>\
主演: 陈坤 / 白百何 / 秦昊 / 喻恩泰 / 王彦霖 / 更多...<br>\
类型: 剧情<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话 / 重庆话<br>\
上映日期: 2016-04-01(中国大陆)<br>\
片长: 95分钟<br>\
又名: 火锅 / Chongqing Hot Pot<br>\
<br>\
<br>\
4.蝙蝠侠大战超人<br>\
<br>\
导演: 扎克·施奈德<br>\
编剧: 克里斯·特里奥 / 大卫·S·高耶 / 鲍勃·凯恩 / 比尔·芬格 / 杰里·西格尔 / 乔·舒斯特<br>\
主演: 本·阿弗莱克 / 亨利·卡维尔 / 艾米·亚当斯 / 盖尔·加朵 / 杰西·艾森伯格 / 更多...<br>\
类型: 动作 / 科幻 / 奇幻 / 冒险<br>\
官方网站: batmanvsupermandawnofjustice.com<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-03-25(中国大陆/美国)<br>\
片长: 151分钟<br>\
<br>\
<br>\
5.疯狂动物城<br>\
<br>\
导演: 拜伦·霍华德 / 瑞奇·摩尔 / 杰拉德·布什<br>\
编剧: 杰拉德·布什 / 菲尔·约翰斯顿<br>\
主演: 金妮弗·古德温 / 杰森·贝特曼 / 伊德里斯·艾尔巴 / 珍妮·斯蕾特 / 内特·托伦斯 / 更多...<br>\
类型: 喜剧 / 动作 / 动画 / 冒险<br>\
官方网站: movies.disney.com/zootopia<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 挪威<br>\
上映日期: 2016-03-04(中国大陆/美国)<br>\
片长: 109分钟(中国大陆) / 108分钟<br>\
<br>\
<br>\
6.海街日记<br>\
<br>\
导演: 是枝裕和<br>\
编剧: 是枝裕和 / 吉田秋生<br>\
主演: 绫濑遥 / 长泽雅美 / 夏帆 / 广濑丝丝 / 大竹忍 / 更多...<br>\
类型: 剧情 / 家庭<br>\
官方网站: umimachi.gaga.ne.jp<br>\
制片国家/地区: 日本<br>\
语言: 日语<br>\
上映日期: 2015-05-14(戛纳电影节) / 2015-06-13(日本)<br>\
片长: 128分钟<br>\
<br>\
<br>\
7.老炮儿<br>\
<br>\
导演: 管虎<br>\
编剧: 管虎 / 董润年<br>\
主演: 冯小刚 / 许晴 / 张涵予 / 刘桦 / 李易峰 / 更多...<br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话<br>\
上映日期: 2015-12-24(中国大陆) / 2015-09-09(威尼斯电影节)<br>\
片长: 137分钟(中国大陆) / 140分钟(威尼斯电影节版)<br>\
'
 
 var  d = dataStar.split('<br><br><br>')
 for(var i=0; i<d.length;i++){
 	var c = d[i].split('<br><br>');
 	data.push({

 		img:c[0].replace('.',' ')+'.jpg',
 		caption: c[0].split('.')[1],
 		desc :c[1]
 	});
 	console.log(c[0].replace('.',' ')+'.jpg');
 }